{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-QUERY",
    "2": "I-QUERY",
    "3": "B-RANK",
    "4": "I-RANK",
    "5": "B-SPONSORED",
    "6": "I-SPONSORED",
    "7": "B-STAR",
    "8": "I-STAR"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-QUERY": 1,
    "B-RANK": 3,
    "B-SPONSORED": 5,
    "B-STAR": 7,
    "I-QUERY": 2,
    "I-RANK": 4,
    "I-SPONSORED": 6,
    "I-STAR": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
